[
  {
    "id": "1.1.1",
    "level": "L1",
    "title": "Ensure Administrative accounts are cloud-only",
    "type": "Automated",
    "profile_applicability": "E3 Level 1",
    "description": "Administrative accounts are special privileged accounts that could have varying levels of access to data, users, and settings. Regular user accounts should never be utilized for administrative tasks and care should be taken, in the case of a hybrid environment, to keep Administrative accounts separated from on-prem accounts. Administrative accounts should not have applications assigned so that they have no access to potentially vulnerable services (EX. email, Teams, SharePoint, etc.) and only access to perform tasks as needed for administrative purposes.\n\nEnsure administrative accounts are not On-premises sync enabled.",
    "rationale": "In a hybrid environment, having separate accounts will help ensure that in the event of a breach in the cloud, that the breach does not affect the on-prem environment and vice versa.",
    "impact": "Administrative users will have to switch accounts and utilizing login/logout functionality when performing administrative tasks, as well as not benefiting from SSO. This will require a migration process from the 'daily driver' account to a dedicated admin account.\n\nWhen migrating permissions to the admin account, both M365 and Azure RBAC roles should be migrated as well. Once the new admin accounts are created both of these permission sets should be moved from the daily driver account to the new admin account. Failure to migrate Azure RBAC roles can cause an admin to not be able to see their subscriptions/resources while using their admin accounts.",
    "output": "<output from PowerShell script here>",
    "remediation": "Remediation will require first identifying the privileged accounts that are synced from onpremises and then creating a new cloud-only account for that user. Once a replacement account is established, the hybrid account should have its role reduced to that of a nonprivileged user or removed depending on the need.",
    "audit_ui": "1. Navigate to Microsoft Entra admin center https://entra.microsoft.com/.\n2. Click to expand Identity > Users select All users.\n3. To the right of the search box click the Add filter button.\n4. Add the On-premises sync enabled filter and click Apply.\n5. For each user account known to be in an administrative role verify it is not present in the filtered list.",
    "audit_powershell": "Connect to Microsoft Graph using:\nConnect-MgGraph -Scopes \"RoleManagement.Read.Directory\",\"User.Read.All\"\n\n# Get privileged role IDs\n$PrivilegedRoles = $DirectoryRoles | Where-Object {\n    $_.DisplayName -like \"*Administrator*\" -or $_.DisplayName -eq \"Global Reader\"\n}\n\n# Get the members of these various roles\n$RoleMembers = $PrivilegedRoles | ForEach-Object { Get-MgDirectoryRoleMember -DirectoryRoleId $_.Id } | Select-Object Id -Unique\n\n# Retrieve details about the members in these roles\n$PrivilegedUsers = $RoleMembers | ForEach-Object {\n    Get-MgUser -UserId $_.Id -Property UserPrincipalName, DisplayName, Id, OnPremisesSyncEnabled\n}\n\n$PrivilegedUsers | Where-Object { $_.OnPremisesSyncEnabled -eq $true } | ft DisplayName,UserPrincipalName,OnPremisesSyncEnabled",
    "references": [
      "https://learn.microsoft.com/en-us/microsoft-365/admin/add-users/add-users?view=o365-worldwide",
      "https://learn.microsoft.com/en-us/microsoft-365/enterprise/protect-your-global-administrator-accounts?view=o365-worldwide",
      "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/best-practices#9-use-cloud-native-accounts-for-microsoft-entra-roles",
      "https://learn.microsoft.com/en-us/entra/fundamentals/whatis",
      "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/permissions-reference"
    ]
  },
  {
    "id": "1.1.2",
    "level": "L1",
    "title": "Ensure two emergency access accounts have been defined",
    "type": "Manual",
    "profile_applicability": "E3 Level 1",
    "description": "Emergency access accounts are accounts that are highly privileged and not assigned to specific individuals. They are not used for daily administrative tasks. These accounts are intended for use when standard administrative accounts cannot be used (e.g., all Global Administrators are locked out).",
    "rationale": "Emergency access accounts help ensure access to the organization’s Microsoft 365 environment during crisis scenarios.",
    "impact": "Organizations must ensure they secure the credentials for these accounts (e.g., using physical safes, secure password vaults, or hardware tokens). These accounts should not be subject to Conditional Access policies that could block access.",
    "output": "<manual verification>",
    "remediation": "1. Create two emergency access accounts\n2. Ensure they are cloud-only, do not require MFA, and are excluded from Conditional Access\n3. Do not assign licenses to these accounts\n4. Store credentials securely and audit access regularly",
    "audit_ui": "1. Navigate to Microsoft Entra admin center https://entra.microsoft.com/.\n2. Expand Identity > Users and click All users.\n3. Identify accounts that:\n  - Are cloud-only\n  - Have Global Administrator role\n  - Are not assigned licenses\n  - Are excluded from Conditional Access policies\n  - Are not assigned to individual people",
    "references": [
      "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/security-emergency-access",
      "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/elevate-access-global-admin"
    ]
  },
  {
    "id": "1.1.3",
    "level": "L1",
    "title": "Ensure that between two and four global admins are designated",
    "type": "Automated",
    "profile_applicability": "E3 Level 1",
    "description": "It is recommended to assign between two and four Global Administrators. Too few and you risk being locked out; too many and you increase your attack surface.",
    "rationale": "Multiple administrators reduce risk of lockout but too many increase risk of breach.",
    "impact": "Having fewer than two increases risk of loss of control. Having more than four increases the chance of misuse or compromise.",
    "output": "<output from PowerShell or Admin Center>",
    "remediation": "Use the Microsoft 365 Admin Center or PowerShell to adjust role assignments accordingly.",
    "audit_ui": "1. Go to https://admin.microsoft.com\n2. Navigate to Roles > Global Administrator\n3. Count number of assigned users",
    "references": [
      "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/permissions-reference#global-administrator"
    ]
  },
  {
    "id": "1.1.4",
    "level": "L1",
    "title": "Ensure administrative accounts use licenses with a reduced application footprint",
    "type": "Automated",
    "profile_applicability": "E3 Level 1",
    "description": "Privileged accounts should be assigned minimal licenses (e.g., Entra ID P1 or P2 only) to reduce the attack surface. These accounts should not have access to services like Exchange Online or SharePoint Online unless necessary.",
    "rationale": "Reducing access to unnecessary applications lowers the risk of exploitation through those services.",
    "impact": "Alerts via email may not be received. Ensure there is an alternate means to notify admins.",
    "output": "<PowerShell output showing license assignments>",
    "remediation": "1. Use Admin Center or PowerShell to identify licenses assigned to admin accounts\n2. Remove unnecessary licenses\n3. Retain only what is required (e.g., Entra ID P1/P2)",
    "audit_ui": "1. Go to https://admin.microsoft.com\n2. Navigate to Users > Active Users\n3. Review license assignments for privileged accounts",
    "references": [
      "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/best-practices",
      "https://learn.microsoft.com/en-us/microsoft-365/admin/add-users/about-admin-roles"
    ]
  }

]
